Autodesk.Revit.DB.ExportRange
This enum is used to define what view, part of the view, or list of views will be exported.
Since:
2011

Autodesk.Revit.DB.ExportRange.SetOfViews
Export a set of views (set in ViewsAndSheets).

Autodesk.Revit.DB.ExportRange.VisibleRegionOfCurrentView
Export the visible region of the current view.

Autodesk.Revit.DB.ExportRange.CurrentView
Export the current view only (zoom to fit of the current view).